# frozen_string_literal: true

# See
#
# * https://github.com/Homebrew/homebrew-bundle
# * `brew bundle --help`

tap "railwaycat/emacsmacport"
tap "tkareine/chnode"

brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "chruby"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "global"
brew "jq"
brew "libressl"
brew "nmap"
brew "node@20"
brew "openssl@3"
brew "pinentry-mac"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-modern-icon"]
brew "readline"
brew "ripgrep"
brew "ruby-install"
brew "shellcheck"
brew "tkareine/chnode/chnode"
brew "yt-dlp"
brew "zoxide"

cask "alfred"
cask "betterdisplay"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "jdk-mission-control"
cask "keepassxc"
cask "rectangle"
cask "spotify"
cask "temurin@21"
cask "thunderbird"
