# frozen_string_literal: true

# Install: `brew bundle install --global`
#
# See:
#
# * https://docs.brew.sh/Brew-Bundle-and-Brewfile
#
# * `man brew`

brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "chruby"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "global"
brew "gnupg"
brew "jq"
brew "libressl"
brew "nmap"
brew "node@24"
brew "openssl@3"
brew "pinentry-mac" if OS.mac?
brew "pnpm"
brew "readline"
brew "ripgrep"
brew "ruby@4"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "yt-dlp"
brew "zoxide"

tap "tkareine/chnode"
brew "tkareine/chnode/chnode"

tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@30", args: %w[with-modern-icon] if OS.mac?

cask "alfred"
cask "betterdisplay"
cask "firefox"
cask "gitup-app"
cask "imageoptim"
cask "iterm2"
cask "jdk-mission-control"
cask "keepassxc"
cask "rectangle"
cask "temurin@25"
cask "thunderbird"

tap "docker/tap"
cask "docker/tap/sbx"
